# Pandas


##### pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

Pandas is the workhorse of Data science and analysis using python.

https://pandas.pydata.org/

* Introduction


* Series


* Dataframes


* Missing Data Handling in pandas


* GroupBy


* Merging, joining, concatenating


* Operations


* Data input and output

### Series

Similar to numpy array built on top of numpy nd-array object.

Series can hold multiple data types

Series is indexed by a label, and has axis labels.

#### Import Libraries

In [1]:
import numpy as np
import pandas as pd

#### Create Series

In [2]:
labels = ['a','b','c']
my_list = [1,2,3]
arr = np.array([10,20,30])
d = {'a':11,'b':22,'c':33}

#### Using List

In [3]:
pd.Series(my_list)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(labels,my_list)

1    a
2    b
3    c
dtype: object

#### Using dictionary

In [6]:
pd.Series(d)

a    11
b    22
c    33
dtype: int64

#### Operations using index

In [7]:
d1 = {'USA':12,'India':15,'China':18,'Russia':10}
d2 = {'USA':15,'India':19,'China':18,'Italy':10}

In [8]:
ser1 = pd.Series(d1)
ser2 = pd.Series(d2)

In [9]:
ser1

USA       12
India     15
China     18
Russia    10
dtype: int64

In [10]:
ser2

USA      15
India    19
China    18
Italy    10
dtype: int64

In [11]:
ser1 + ser2

China     36.0
India     34.0
Italy      NaN
Russia     NaN
USA       27.0
dtype: float64

#### DataFrames 

* Workhorse of pandas


* Bunch of Series objects with same index put together is called DataFrame

In [12]:
df = pd.DataFrame(data=np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [13]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [14]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

#### Selection and Indexing

In [15]:
df['W']

A    0.678009
B   -1.562030
C   -0.555808
D   -0.551073
E   -0.367266
Name: W, dtype: float64

In [16]:
df[['W','Z']]

          W         Z
A  0.678009  0.815527
B -1.562030  0.700252
C -0.555808  0.177404
D -0.551073  0.670517
E -0.367266  0.420992

In [17]:
df['W']

A    0.678009
B   -1.562030
C   -0.555808
D   -0.551073
E   -0.367266
Name: W, dtype: float64

In [18]:
df.W  # SQL Syntax - Not Recommended

A    0.678009
B   -1.562030
C   -0.555808
D   -0.551073
E   -0.367266
Name: W, dtype: float64

In [19]:
df['new'] = df['W']+df['Z']

In [20]:
df

          W         X         Y         Z       new
A  0.678009  1.346540  1.100533  0.815527  1.493537
B -1.562030 -2.067624  0.536108  0.700252 -0.861778
C -0.555808  0.035241  0.209648  0.177404 -0.378404
D -0.551073 -0.574254  0.221004  0.670517  0.119444
E -0.367266  0.673372  0.056798  0.420992  0.053726

In [21]:
df['sum'] = df['Y']+df['X']

In [22]:
df

          W         X         Y         Z       new       sum
A  0.678009  1.346540  1.100533  0.815527  1.493537  2.447073
B -1.562030 -2.067624  0.536108  0.700252 -0.861778 -1.531517
C -0.555808  0.035241  0.209648  0.177404 -0.378404  0.244889
D -0.551073 -0.574254  0.221004  0.670517  0.119444 -0.353251
E -0.367266  0.673372  0.056798  0.420992  0.053726  0.730170

In [23]:
df.sum # SQL Syntax Fails

<bound method DataFrame.sum of           W         X         Y         Z       new       sum
A  0.678009  1.346540  1.100533  0.815527  1.493537  2.447073
B -1.562030 -2.067624  0.536108  0.700252 -0.861778 -1.531517
C -0.555808  0.035241  0.209648  0.177404 -0.378404  0.244889
D -0.551073 -0.574254  0.221004  0.670517  0.119444 -0.353251
E -0.367266  0.673372  0.056798  0.420992  0.053726  0.730170>

In [24]:
df['sum'] # Pandas syntax

A    2.447073
B   -1.531517
C    0.244889
D   -0.353251
E    0.730170
Name: sum, dtype: float64

In [25]:
df.drop('new',axis=1)

          W         X         Y         Z       sum
A  0.678009  1.346540  1.100533  0.815527  2.447073
B -1.562030 -2.067624  0.536108  0.700252 -1.531517
C -0.555808  0.035241  0.209648  0.177404  0.244889
D -0.551073 -0.574254  0.221004  0.670517 -0.353251
E -0.367266  0.673372  0.056798  0.420992  0.730170

In [26]:
df

          W         X         Y         Z       new       sum
A  0.678009  1.346540  1.100533  0.815527  1.493537  2.447073
B -1.562030 -2.067624  0.536108  0.700252 -0.861778 -1.531517
C -0.555808  0.035241  0.209648  0.177404 -0.378404  0.244889
D -0.551073 -0.574254  0.221004  0.670517  0.119444 -0.353251
E -0.367266  0.673372  0.056798  0.420992  0.053726  0.730170

In [27]:
df = df.drop('new',axis=1)

In [28]:
df

          W         X         Y         Z       sum
A  0.678009  1.346540  1.100533  0.815527  2.447073
B -1.562030 -2.067624  0.536108  0.700252 -1.531517
C -0.555808  0.035241  0.209648  0.177404  0.244889
D -0.551073 -0.574254  0.221004  0.670517 -0.353251
E -0.367266  0.673372  0.056798  0.420992  0.730170

In [29]:
df.drop('sum',axis=1)

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

In [30]:
df

          W         X         Y         Z       sum
A  0.678009  1.346540  1.100533  0.815527  2.447073
B -1.562030 -2.067624  0.536108  0.700252 -1.531517
C -0.555808  0.035241  0.209648  0.177404  0.244889
D -0.551073 -0.574254  0.221004  0.670517 -0.353251
E -0.367266  0.673372  0.056798  0.420992  0.730170

In [31]:
df.drop('sum',axis=1,inplace=True)

In [32]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

In [33]:
df.drop('E')

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517

In [34]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

#### Selection

In [35]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

In [36]:
df.loc['A'] # Selection using label index

W    0.678009
X    1.346540
Y    1.100533
Z    0.815527
Name: A, dtype: float64

In [37]:
df.iloc[2] # Selection using numeric index

W   -0.555808
X    0.035241
Y    0.209648
Z    0.177404
Name: C, dtype: float64

##### Selecting subsets of rows and columns

In [38]:
df.loc['B','Y']

0.5361078195712022

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.678009  1.100533
B -1.562030  0.536108

#### Conditional Selection

In [40]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

In [41]:
df[df['W'] > 0]

          W        X         Y         Z
A  0.678009  1.34654  1.100533  0.815527

In [42]:
df['W'] > 0

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [43]:
df>0

       W      X     Y     Z
A   True   True  True  True
B  False  False  True  True
C  False   True  True  True
D  False  False  True  True
E  False   True  True  True

In [44]:
df[df>0]

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B       NaN       NaN  0.536108  0.700252
C       NaN  0.035241  0.209648  0.177404
D       NaN       NaN  0.221004  0.670517
E       NaN  0.673372  0.056798  0.420992

In [45]:
df[df>0]['Z']

A    0.815527
B    0.700252
C    0.177404
D    0.670517
E    0.420992
Name: Z, dtype: float64

#### playing w index

In [46]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

In [47]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.678009  1.346540  1.100533  0.815527
1     B -1.562030 -2.067624  0.536108  0.700252
2     C -0.555808  0.035241  0.209648  0.177404
3     D -0.551073 -0.574254  0.221004  0.670517
4     E -0.367266  0.673372  0.056798  0.420992

In [48]:
df

          W         X         Y         Z
A  0.678009  1.346540  1.100533  0.815527
B -1.562030 -2.067624  0.536108  0.700252
C -0.555808  0.035241  0.209648  0.177404
D -0.551073 -0.574254  0.221004  0.670517
E -0.367266  0.673372  0.056798  0.420992

In [49]:
newIdx = 'US UK IN GE JP'.split()
newIdx

['US', 'UK', 'IN', 'GE', 'JP']

In [50]:
df['Idx'] = newIdx

df.set_index('Idx')

            W         X         Y         Z
Idx
US   0.678009  1.346540  1.100533  0.815527
UK  -1.562030 -2.067624  0.536108  0.700252
IN  -0.555808  0.035241  0.209648  0.177404
GE  -0.551073 -0.574254  0.221004  0.670517
JP  -0.367266  0.673372  0.056798  0.420992

In [51]:
df

          W         X         Y         Z Idx
A  0.678009  1.346540  1.100533  0.815527  US
B -1.562030 -2.067624  0.536108  0.700252  UK
C -0.555808  0.035241  0.209648  0.177404  IN
D -0.551073 -0.574254  0.221004  0.670517  GE
E -0.367266  0.673372  0.056798  0.420992  JP

#### Multi-Index and Hierarchy

In [52]:
countries = 'US US US IN IN IN CN CN CN'.split()

states = 'TX CA NV HR DL TN GN XY YX'.split()

In [53]:
countries

['US', 'US', 'US', 'IN', 'IN', 'IN', 'CN', 'CN', 'CN']

In [54]:
states

['TX', 'CA', 'NV', 'HR', 'DL', 'TN', 'GN', 'XY', 'YX']

In [55]:
hierIdx = list(zip(countries,states))
hierIdx

[('US', 'TX'),
 ('US', 'CA'),
 ('US', 'NV'),
 ('IN', 'HR'),
 ('IN', 'DL'),
 ('IN', 'TN'),
 ('CN', 'GN'),
 ('CN', 'XY'),
 ('CN', 'YX')]

In [56]:
hierIdx = pd.MultiIndex.from_tuples(hierIdx)
hierIdx

MultiIndex([('US', 'TX'),
            ('US', 'CA'),
            ('US', 'NV'),
            ('IN', 'HR'),
            ('IN', 'DL'),
            ('IN', 'TN'),
            ('CN', 'GN'),
            ('CN', 'XY'),
            ('CN', 'YX')],
           )

In [57]:
df = pd.DataFrame(data=[100,200,300,400,500,600,7,8,9],
                  index=hierIdx,
                  columns=['Number Recovered'])#,'Number'])

In [58]:
df

       Number Recovered
US TX               100
   CA               200
   NV               300
IN HR               400
   DL               500
   TN               600
CN GN                 7
   XY                 8
   YX                 9

In [59]:
df.loc['IN']

    Number Recovered
HR               400
DL               500
TN               600

In [60]:
df.loc['IN'].loc['HR']

Number Recovered    400
Name: HR, dtype: int64

#### Missing Data Handling

In [61]:
df = pd.DataFrame({'A':[1,2,3],
                   'B':[5,np.nan,4],
                   'C':[6,7,np.nan],
                   'D':[112,9,np.nan],
                   'E':[11,12,14]})

df

   A    B    C      D   E
0  1  5.0  6.0  112.0  11
1  2  NaN  7.0    9.0  12
2  3  4.0  NaN    NaN  14

###### Strategy

1. Fill missing values - Imputation


2. Drop missing values

In [62]:
df.dropna()

   A    B    C      D   E
0  1  5.0  6.0  112.0  11

In [63]:
df.dropna(axis=1)

   A   E
0  1  11
1  2  12
2  3  14

In [64]:
df.dropna(thresh=2)#,axis=1)

   A    B    C      D   E
0  1  5.0  6.0  112.0  11
1  2  NaN  7.0    9.0  12
2  3  4.0  NaN    NaN  14

In [65]:
df

   A    B    C      D   E
0  1  5.0  6.0  112.0  11
1  2  NaN  7.0    9.0  12
2  3  4.0  NaN    NaN  14

In [66]:
df.dropna()

   A    B    C      D   E
0  1  5.0  6.0  112.0  11

In [67]:
df= pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan],
                 'C':[1,2,3]})

In [68]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [69]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [70]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [71]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
df.fillna('VALUE TO FILL')

               A              B  C
0              1              5  1
1              2  VALUE TO FILL  2
2  VALUE TO FILL  VALUE TO FILL  3

In [73]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [74]:
a=[12,32,32,33]
b=[12,323,4,34]

list(zip(a,b))

[(12, 12), (32, 323), (32, 4), (33, 34)]

#### Groupby

In [75]:
cmp = 'GOOG GOOG GOOG AAPL AAPL AAPL FB FB FB MSFT MSFT MSFT AMZN AMZN AMZN'.split()
sp = 'VIPUL VIVEK EMANI VISHNU DEEPAK RASHMI HARISH CHARMI VISHAL ANOOP AMAL KHASIM RISHABH INDRANIL RAJASHEKHAR'.split()
sales = [100,2,3,4,5,6,7,9,10,11,12,13,14,15,16]

In [76]:
len(sales)

15

In [77]:
df = pd.DataFrame(sales)

In [78]:
df['Company']=cmp
df['Salesperson']=sp

In [79]:
df

      0 Company  Salesperson
0   100    GOOG        VIPUL
1     2    GOOG        VIVEK
2     3    GOOG        EMANI
3     4    AAPL       VISHNU
4     5    AAPL       DEEPAK
5     6    AAPL       RASHMI
6     7      FB       HARISH
7     9      FB       CHARMI
8    10      FB       VISHAL
9    11    MSFT        ANOOP
10   12    MSFT         AMAL
11   13    MSFT       KHASIM
12   14    AMZN      RISHABH
13   15    AMZN     INDRANIL
14   16    AMZN  RAJASHEKHAR

In [80]:
df.groupby('Company')

In [81]:
df.groupby('Company').mean()

                 0
Company
AAPL      5.000000
AMZN     15.000000
FB        8.666667
GOOG     35.000000
MSFT     12.000000

In [82]:
df.groupby('Company').sum()

           0
Company
AAPL      15
AMZN      45
FB        26
GOOG     105
MSFT      36

In [83]:
df.groupby('Company').min()

          0 Salesperson
Company
AAPL      4      DEEPAK
AMZN     14    INDRANIL
FB        7      CHARMI
GOOG      2       EMANI
MSFT     11        AMAL

In [84]:
df.groupby('Company').max()

           0 Salesperson
Company
AAPL       6      VISHNU
AMZN      16     RISHABH
FB        10      VISHAL
GOOG     100       VIVEK
MSFT      13      KHASIM

In [85]:
df.groupby('Company').describe()

            0
        count       mean        std   min   25%   50%   75%    max
Company
AAPL      3.0   5.000000   1.000000   4.0   4.5   5.0   5.5    6.0
AMZN      3.0  15.000000   1.000000  14.0  14.5  15.0  15.5   16.0
FB        3.0   8.666667   1.527525   7.0   8.0   9.0   9.5   10.0
GOOG      3.0  35.000000  56.293872   2.0   2.5   3.0  51.5  100.0
MSFT      3.0  12.000000   1.000000  11.0  11.5  12.0  12.5   13.0

In [86]:
df.groupby('Company').describe().transpose()

Company  AAPL  AMZN         FB        GOOG  MSFT
0 count   3.0   3.0   3.000000    3.000000   3.0
  mean    5.0  15.0   8.666667   35.000000  12.0
  std     1.0   1.0   1.527525   56.293872   1.0
  min     4.0  14.0   7.000000    2.000000  11.0
  25%     4.5  14.5   8.000000    2.500000  11.5
  50%     5.0  15.0   9.000000    3.000000  12.0
  75%     5.5  15.5   9.500000   51.500000  12.5
  max     6.0  16.0  10.000000  100.000000  13.0

select sum(salary) from salaries groupby designation;

#### Pivot Table

In [87]:
url = "https://raw.githubusercontent.com/resbaz/r-novice-gapminder-files/master/data/gapminder-FiveYearData.csv"

df = pd.read_csv(url)

df

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [88]:
df.shape

(1704, 6)

In [89]:
df.describe()

             year           pop      lifeExp      gdpPercap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165877
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846989
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   year       1704 non-null   int64
 2   pop        1704 non-null   float64
 3   continent  1704 non-null   object
 4   lifeExp    1704 non-null   float64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 80.0+ KB

In [92]:
df1 = df[['continent','lifeExp']]
df1.head(20)

   continent  lifeExp
0       Asia   28.801
1       Asia   30.332
2       Asia   31.997
3       Asia   34.020
4       Asia   36.088
5       Asia   38.438
6       Asia   39.854
7       Asia   40.822
8       Asia   41.674
9       Asia   41.763
10      Asia   42.129
11      Asia   43.828
12    Europe   55.230
13    Europe   59.280
14    Europe   64.820
15    Europe   66.220
16    Europe   67.690
17    Europe   68.930
18    Europe   70.420
19    Europe   72.000

In [93]:
pd.pivot_table(df1,values='lifeExp',columns='continent',aggfunc='mean')

continent    Africa   Americas       Asia     Europe    Oceania
lifeExp    48.86533  64.658737  60.064903  71.903686  74.326208

In [94]:
df2 = df[['continent','lifeExp','year']]
df2.head()

  continent  lifeExp  year
0      Asia   28.801  1952
1      Asia   30.332  1957
2      Asia   31.997  1962
3      Asia   34.020  1967
4      Asia   36.088  1972

In [95]:
pd.pivot_table(df2,values='lifeExp',index=['year'],columns='continent')

continent     Africa  Americas       Asia     Europe  Oceania
year
1952       39.135500  53.27984  46.314394  64.408500  69.2550
1957       41.266346  55.96028  49.318544  66.703067  70.2950
1962       43.319442  58.39876  51.563223  68.539233  71.0850
1967       45.334538  60.41092  54.663640  69.737600  71.3100
1972       47.450942  62.39492  57.319269  70.775033  71.9100
1977       49.580423  64.39156  59.610556  71.937767  72.8550
1982       51.592865  66.22884  62.617939  72.806400  74.2900
1987       53.344788  68.09072  64.851182  73.642167  75.3200
1992       53.629577  69.56836  66.537212  74.440100  76.9450
1997       53.598269  71.15048  68.020515  75.505167  78.1900
2002       53.325231  72.42204  69.233879  76.700600  79.7400
2007       54.806038  73.60812  70.728485  77.648600  80.7195

In [96]:
pd.pivot_table(df2,values='lifeExp',index=['year'],columns='continent',aggfunc='min')

continent  Africa  Americas    Asia  Europe  Oceania
year
1952       30.000    37.579  28.801  43.585   69.120
1957       31.570    40.696  30.332  48.079   70.260
1962       32.767    43.428  31.997  52.098   70.930
1967       34.113    45.032  34.020  54.336   71.100
1972       35.400    46.714  36.088  57.005   71.890
1977       36.788    49.923  31.220  59.507   72.220
1982       38.445    51.461  39.854  61.036   73.840
1987       39.906    53.636  40.822  63.108   74.320
1992       23.599    55.089  41.674  66.146   76.330
1997       36.087    56.671  41.763  68.835   77.550
2002       39.193    58.137  42.129  70.845   79.110
2007       39.613    60.916  43.828  71.777   80.204

In [100]:
df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [102]:
df['country'].value_counts()

Togo          12
Japan         12
Egypt         12
Jordan        12
Costa Rica    12
              ..
Taiwan        12
Hungary       12
Romania       12
Korea Rep.    12
Guinea        12
Name: country, Length: 142, dtype: int64

In [103]:
df['continent'].value_counts()

Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: continent, dtype: int64

In [104]:
single = df.groupby('continent').agg({'lifeExp':['mean','min','max']})

print(single)

             lifeExp
                mean     min     max
continent
Africa     48.865330  23.599  76.442
Americas   64.658737  37.579  80.653
Asia       60.064903  28.801  82.603
Europe     71.903686  43.585  81.757
Oceania    74.326208  69.120  81.235

In [105]:
single.columns = ['lifeexp_mean','lifeexp_min','lifeexp_max']

single = single.reset_index()

print(single)

  continent  lifeexp_mean  lifeexp_min  lifeexp_max
0    Africa     48.865330       23.599       76.442
1  Americas     64.658737       37.579       80.653
2      Asia     60.064903       28.801       82.603
3    Europe     71.903686       43.585       81.757
4   Oceania     74.326208       69.120       81.235

In [106]:
grouped = df.groupby(['continent','country']).agg({'lifeExp':['mean','min','max']})
grouped.columns = ['lifeexp_mean','lifeexp_min','lifeexp_max']
grouped = grouped.reset_index()
print(grouped)

    continent         country  lifeexp_mean  lifeexp_min  lifeexp_max
0      Africa         Algeria     59.030167       43.077       72.301
1      Africa          Angola     37.883500       30.015       42.731
2      Africa           Benin     48.779917       38.223       56.728
3      Africa        Botswana     54.597500       46.634       63.622
4      Africa    Burkina Faso     44.694000       31.975       52.295
..        ...             ...           ...          ...          ...
137    Europe     Switzerland     75.565083       69.620       81.701
138    Europe          Turkey     59.696417       43.585       71.777
139    Europe  United Kingdom     73.922583       69.180       79.425
140   Oceania       Australia     74.662917       69.120       81.235
141   Oceania     New Zealand     73.989500       69.390       80.204

[142 rows x 5 columns]

#### How to find length of array

In [97]:
import numpy as np
arr = np.arange(0,11)
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [98]:
len(arr[arr>4])

6

# Great Job !